import streamlit as st
from send_mail import send_mail

title = st.title("Изненада вечеря 🍽️")
answer = st.selectbox(
    "Здравей Силви ☀️! Най-официално искам да те поканя на вечеря която ти следва да избереш. 😊 \n"
    " Приемаш ли моето предложение ?", ("", "Да", "Не"))
if answer == "Не":
    st.info("Лошо, лошо изглежда си избрала грешен отговор, опитай пак. 🥲")
elif answer == "Да":
    st.write("Щом си стигнала дотук значи нещата се подобравят 😇")
    food = st.selectbox("Какво ти се хапва?",
                        ("",
                         "Италианско 🇮🇹",
                         "Гъзарско и луксозно 💎",
                         "Нещо класическо и скучно 😒",
                         "Нещо специално приготвено от мен за теб 🤔"))
    if food:
        date = st.selectbox(
            "Моля избери дата в която би ти било удобно да се състои: ",
            ("", "18.12", "19.12", "20.12", "21.12", "22.12"))

        if date:
            time = st.selectbox(
                "Остана само да избереш час и всичко е готово ",
                ("", "19:00", "19:30", "20:00", "20:30", "21:00"))

            if time:
                message = st.text_area(
                    "Ако искаш да ми кажеш нещо тук ти e шансът 😄: ")

                if st.button("Изпрати"):
                    body = (f"Тя избра {food} на {date} в {time}. \n"
                            f"Съобщение от нея: {message}")
                    send_mail("Отговор", body)

                    if food == "Нещо специално приготвено от мен за теб 🤔":
                        st.success("Уфф сега ще трябва да чистя 😆. \n "
                                   f"Очаквам те в нас на {date} в {time}")
                    else:
                        st.success(
                            "Благодаря, като планирано всичко ще те уведомя"
                            ", oчаквай изненада. 🥳")
